Repository: ProfessorNavigator/mylibrary
Catalog: po/*.po
Languages: ru

source: Collection
ru: Коллекция

source: Create collection
ru: Создать коллекцию

source: Refresh collection
ru: Обновить коллекцию

source: Import collection
ru: Импортировать коллекцию

source: Export collection
ru: Экспортировать коллекцию

source: Add book to collection
ru: Добавить книгу в коллекцию

source: Remove collection
ru: Удалить коллекцию

source: Book-marks
ru: Закладки

source: Show book-marks
ru: Показать закладки

source: About
ru: Справка

source: About program
ru: О программе

source: Collection name cannot be empty!
ru: Имя коллекции не может быть пустым!

source: Path to book directory is empty!
ru: Путь к папке с книгами пуст!

source: Collection has been created
ru: Коллекция создана

source: Collection already existed!
ru: Коллекция уже существует!

source: Collection creation canceled
ru: Создание коллекции прекращено

source: Collection to import path is empty!
ru: Путь до коллекции пуст!

source: Export path is empty!
ru: Путь для экспорта пуст!

source: Book has been removed from collection database, but book file was not found. Check if collection book directory path exists and/or refresh collection.
ru: Книга была удалена из базы данных коллекции, но файл книги не найден. Проверьте, существует ли папка коллекции и/или обновите коллекцию.

source: Book-mark has been created!
ru: Закладка создана!

source: The book has been copied
ru: Книга скопирована

source: Error: book path is empty!
ru: Ошибка: путь до книги пуст!

source: Error: book name is empty!
ru: Ошибка: имя книги не назначено!

source: Error: source book file does not exists!
ru: Ошибка: файл книги не существует!

source: Book operations list
ru: Операции с книгой

source: Open selected book
ru: Открыть выбранную книгу

source: File info
ru: Информация о файле

source: Save book as...
ru: Сохранить книгу как...

source: Remove selected book from book-marks
ru: Удалить выбранную книгу из закладок

source: Author
ru: Автор

source: Book
ru: Книга

source: Series
ru: Серия

source: Genre
ru: Жанр

source: Date
ru: Дата

source: This action will remove book from bookmarks. Continue?
ru: Это действие удалит книгу из закладок. Продолжить?

source: No
ru: Нет

source: Yes
ru: Да

source: MyLibrary is a home librarian
ru: MyLibrary - домашний библиотекарь

source: Author Yury Bobylev
ru: Автор Юрий Бобылев

source: Program uses next libraries:
ru: В программе используются следующие библиотеки:

source: Book file exits. Replace?
ru: Файл книги уже существует. Заменить?

source: Book cover
ru: Обложка книги

source: Search
ru: Поиск

source: Search in progress...
ru: Идёт поиск...

source: Cancel
ru: Отмена

source: Canceling...
ru: Отмена...

source: This action will remove book from collection and file system. Continue?
ru: Это действие удалит книгу из коллекции и из файловой системы. Продолжить?

source: Removing... It will take some time
ru: Удаление... Процесс займёт какое-то время

source: Book is in rar archive and cannot be remove separately. Remove whole archive?
ru: Книга упакована в rar архив и не может быть удалена отдельно. Удалить архив целиком?

source: Book file info
ru: Информация о файле

source: Archive:
ru: Архив:

source: File path in archive:
ru: Расположение файла в архиве:

source: File size (uncompressed):
ru: Размер файла (после распаковки):

source: bytes
ru: байт

source: File size (compressed):
ru: Размер файла (в архиве):

source: File does not exists!
ru: Файл не существует!

source: File:
ru: Файл:

source: File size:
ru: Размер файла:

source: Book entry editor
ru: Редактор записи о книге

source: Author:
ru: Автор:

source: Book:
ru: Книга:

source: Series:
ru: Серия:

source: Genre:
ru: Жанр:

source: Add genre:
ru: Добавить жанр:

source: <No>
ru: <Нет>

source: Date:
ru: Дата:

source: Save
ru: Сохранить

source: Restore
ru: Восстановить

source: Confirmation
ru: Подтверждение

source: Are you shure?
ru: Вы уверены?

source: Book entry has been corrected
ru: Запись о книге отредактирована

source: Close
ru: Закрыть

source: Correcting base...
ru: Корректирование базы данных...

source: Save as...
ru: Сохранить как...

source: Collection removing
ru: Удаление коллекции

source: Collection refreshing
ru: Обновление коллекции

source: Book adding
ru: Добавление книги

source: Collection for removing:
ru: Коллекция для удаления:

source: Collection for refreshing:
ru: Коллекция для обновления:

source: Collection which book should be added to:
ru: Коллекция, в которую нужно добавить книгу:

source: Number of threads to use (it is not recommended to exceed
ru: Количество потоков (не рекомендуется использовать больше, чем

source: Remove empty directories in collection
ru: Удалить пустые папки из директории с книгами коллекции

source: Fast collection refreshing (without hash checking)
ru: Быстрое обновление коллекции (без сверки хеш-сумм)

source: Path to source book file:
ru: Путь до исходного файла книги:

source: Open
ru: Открыть

source: Book file path in collection directory:
ru: Путь до файла книги в коллекции:

source: Pack book to archive, if it is not already packed:
ru: Упаковать книгу в архив, если она ещё не упакована:

source: Remove
ru: Удалить

source: Refresh
ru: Обновить

source: Add book
ru: Добавить книгу

source: Are you sure?
ru: Вы уверены?

source: Files hashing...
ru: Хеширование файлов...

source: Collection refreshing...
ru: Обновление коллекции...

source: Collection refreshing canceled
ru: Обновление коллекции прекращено

source: Collection refreshing finished
ru: Обновление коллекции выполнено

source: Collection book directory not found
ru: Папка с книгами коллекции не найдена

source: Collection name:
ru: Имя коллекции:

source: Path to directory with books:
ru: Путь к папке с книгами:

source: Create
ru: Создать

source: Book directory
ru: Папка с книгами

source: Path to collection
ru: Путь до файлов коллекции

source: Export as...
ru: Экспортировать как...

source: Export
ru: Экспорт

source: Collection import
ru: Импорт коллекции

source: Path to collection files:
ru: Путь до файлов коллекции:

source: Path to books:
ru: Путь к папке с книгами:

source: Collection has been imported
ru: Коллекция импортирована

source: Collection for export:
ru: Коллекция для экспорта:

source: Export as:
ru: Экспортировать как:

source: Collection has been exported
ru: Коллекция экспортирована

source: Surname:
ru: Фамилия:

source: Name:
ru: Имя:

source: Second name:
ru: Отчество:

source: Book name:
ru: Название книги:

source: Clear
ru: Очистить

source: Science Fiction & Fantasy
ru: Фантастика (Научная фантастика и Фэнтези)

source: Alternative history
ru: Альтернативная история

source: Action
ru: Боевик

source: Epic
ru: Эпическая фантастика

source: Heroic
ru: Героическая фантастика

source: Detective
ru: Детектив

source: Cyberpunk
ru: Киберпанк

source: Space
ru: Космическая фантастика

source: Social-philosophical
ru: Социально-психологическая фантастика

source: Horror & mystic
ru: Ужасы и мистика

source: Humor
ru: Юмор

source: Fantasy
ru: Фэнтези

source: Science Fiction
ru: Научная фантастика

source: Detectives & Thrillers
ru: Детективы и триллеры

source: Classical detectives
ru: Классический детектив

source: Police Stories
ru: Полицейский детектив

source: Ironical detectives
ru: Иронический детектив

source: Historical detectives
ru: Исторический детектив

source: Espionage detectives
ru: Шпионский детектив

source: Crime detectives
ru: Криминальный детектив

source: Political detectives
ru: Политический детектив

source: Maniacs
ru: Маньяки

source: Hard-boiled
ru: Крутой детектив

source: Thrillers
ru: Триллер

source: Detectives
ru: Детектив (прочее)

source: Prose
ru: Проза

source: Classics prose
ru: Классическая проза

source: Historical prose
ru: Историческая проза

source: Contemporary prose
ru: Современная проза

source: Counterculture
ru: Контркультура

source: Russial classics prose
ru: Русская классическая проза

source: Soviet classics prose
ru: Советская классическая проза

source: Romance
ru: Любовные романы

source: Contemporary Romance
ru: Современные любовные романы

source: Historical Romance
ru: Исторические любовные романы

source: Detective Romance
ru: Остросюжетные любовные романы

source: Short Romance
ru: Короткие любовные романы

source: Erotica
ru: Эротика

source: Adventure
ru: Приключения

source: Western
ru: Вестерн

source: History
ru: История

source: Indians
ru: Приключения про индейцев

source: Maritime Fiction
ru: Морские приключения

source: Travel & geography
ru: Путешествия и география

source: Nature & animals
ru: Природа и животные

source: Other
ru: Другое

source: Children's
ru: Детская литература

source: Fairy Tales
ru: Сказки

source: Verses
ru: Стихи

source: Adventures
ru: Приключения

source: Educational
ru: Образовательная литература

source: Poetry & Dramaturgy
ru: Поэзия и драматургия

source: Poetry
ru: Поэзия

source: Dramaturgy
ru: Драматургия

source: Antique literature
ru: Старинное

source: Antique
ru: Античная литература

source: European
ru: Европейская старинная литература

source: Old russian
ru: Древнерусская литература

source: Old east
ru: Древневосточная литература

source: Myths. Legends. Epos.
ru: Мифы. Легенды. Эпос.

source: Scientific-educational
ru: Наука и образование

source: Psychology
ru: Психология

source: Cultural science
ru: Культурология

source: Religious studies
ru: Религиоведение

source: Philosophy
ru: Философия

source: Politics
ru: Политика

source: Business literature
ru: Деловая литература

source: Jurisprudence
ru: Юриспурденция

source: Linguistics
ru: Языкознание

source: Medicine
ru: Медицина

source: Physics
ru: Физика

source: Mathematics
ru: Математика

source: Chemistry
ru: Химия

source: Biology
ru: Биология

source: Technical
ru: Технические науки

source: Computers & Internet
ru: Компьютеры и интернет

source: Internet
ru: Интернет

source: Programming
ru: Программирование

source: Hardware
ru: Аппаратное обеспечение

source: Software
ru: Программное обеспечение

source: Databases
ru: Базы данных

source: OS & Networking
ru: ОС и сети

source: Reference
ru: Справочники

source: Encyclopedias
ru: Энциклопедии

source: Dictionaries
ru: Словари

source: Guidebooks
ru: Руководства

source: Nonfiction
ru: Документальная литература

source: Biography & Memoirs
ru: Биографии и мемуары

source: Publicism
ru: Публицистика

source: Criticism
ru: Критика

source: Art & design
ru: Искусство и дизайн

source: Religion & Inspirationn
ru: Религия и духовность

source: Religion
ru: Религия

source: Esoterics
ru: Эзотерика

source: Self-improvement
ru: Самосовершенствование

source: Anecdote (funny stories)
ru: Анекдоты

source: Home & Family
ru: Дом и семья

source: Cooking
ru: Кулинария

source: Pets
ru: Домашние животные

source: Hobbies & Crafts
ru: Хобби и ремёсла

source: Entertaining
ru: Развлечения

source: Health
ru: Здоровье

source: Garden
ru: Сад и огород

source: Do it yourself
ru: Сделай сам

source: Sports
ru: Спорт

source: Erotica & sex
ru: Эротика и секс

source: Create book-mark
ru: Создать закладку

source: Edit book entry
ru: Редактировать запись о книге

source: Remove book
ru: Удалить книгу

source: Collection creation progress
ru: Прогресс создания коллекции

source: Creation progress
ru: Прогресс создания

source: Choose a book
ru: Выберите книгу

source: All supported
ru: Все поддерживаемые

source: Books adding...
ru: Добавление книги...

source: Book adding in progress...
ru: Добавление книги...

source: Book adding canceled
ru: Добавление книги прекращено

source: Book adding error!
ru: Ошибка при добавлении книги!

source: Book adding finished
ru: Книга добавлена

source: Collection book path does not exists!
ru: Папка с книгами коллекции не существует!
