Repository: ProfessorNavigator/mylibrary
Catalog: po/MyLibrary.po
Languages: ru

source: Directory adding
ru: Добавление папок

source: Books adding
ru: Добавление книг

source: Collection directories to be added to
ru: Коллекция для добавления папок

source: Collection books to be added to
ru: Коллекция для добавления книг

source: Remove source files
ru: Удалить исходные файлы

source: Pack directories in archive
ru: Упаковать папки в архив

source: Pack books in archive
ru: Упаковать книги в архив

source: Add directories to existing archive
ru: Добавить папки к существующему архиву

source: (archive will be recreated)
ru: (архив будет создан заново)

source: Add books to existing archive
ru: Добавить книги к существующему архиву

source: Archive type:
ru: Тип архива:

source: Add directories
ru: Добавить папки

source: Add books
ru: Добавить книги

source: Cancel
ru: Отмена

source: Archive path
ru: Путь к архиву

source: Select archive
ru: Выбрать архив

source: Book selection
ru: Выбор книг

source: Path of archive in collection:
ru: Путь к архиву в коллекции:

source: Directories
ru: Папки

source: Books
ru: Книги

source: Directory operations
ru: Операции с папками

source: Books operations
ru: Операции с книгами

source: Add
ru: Добавить

source: All supported
ru: Все поддерживаемые

source: Open
ru: Открыть

source: Sources
ru: Источники

source: Collection paths
ru: Пути в коллекции

source: Warning! Some result paths are out of collection!
ru: Предупреждение! Некоторые конечные пути находятся вне коллекции!

source: Warning! Some result directories exist and will be overwritten!
ru: Предупреждение! Некоторые конечные папки уже существуют и будут перезаписаны!

source: Warning! Some result files exist and will be overwritten!
ru: Предупреждение! Некоторые конечные файлы уже существуют и будут перезаписаны!

source: Remove directory
ru: Удалить папку

source: Remove book
ru: Удалить книгу

source: Change collection path
ru: Изменить путь в коллекции

source: Change archive path
ru: Изменить путь в архиве

source: Collection path
ru: Путь в коллекции

source: Save
ru: Сохранить

source: Directories adding in progress...
ru: Идёт добавление папок...

source: Books adding in progress...
ru: Идёт добавление книг...

source: Directories were successfully added!
ru: Папки успешно добавлены!

source: Books were successfully added!
ru: Книги успешно добавлены!

source: Error! See system log for details.
ru: Ошибка! См. системный журнал.

source: Close
ru: Закрыть

source: Error!
ru: Ошибка!

source: Error: name conflict!
ru: Ошибка: конфликт имён!

source: Error: result archive path is out of collection
ru: Ошибка: путь конечного архива вне коллекции

source: Error: path cannot be empty
ru: Ошибка: путь не может быть пустым

source: Error: files or directories adding to fbd archives is prohibited
ru: Ошибка: добавление файлов или папок в архивы fbd запрещено

source: Archive name
ru: Имя архива

source: Paths in archive
ru: Пути в архиве

source: Path in archive
ru: Путь в архиве

source: Path in archive:
ru: Путь в архиве:

source: Apply
ru: Применить

source: Supported archives
ru: Поддерживаемые архивы

source: Warning! Some files are already in archive!
ru: Предупреждение! Некоторые файлы уже есть в архиве!

source: Wait...
ru: Подождите...

source: Book info
ru: Информация о книге

source: Book
ru: Книга

source: Book name:
ru: Название книги:

source: Author(s):
ru: Автор(ы):

source: Genre(s):
ru: Жанр(ы):

source: Series:
ru: Серия:

source: Language:
ru: Язык:

source: Source language:
ru: Язык оригинала:

source: Translator(s):
ru: Переводчик(и):

source: File
ru: Файл

source: File path:
ru: Путь:

source: file not found
ru: файл не найден

source: Paper book info
ru: Информация о бумажной книге

source: Publisher:
ru: Издатель:

source: City:
ru: Город:

source: Year:
ru: Год:

source: E-Book info
ru: Информация о электронной книге

source: Software:
ru: Программа:

source: Date:
ru: Дата:

source: Source:
ru: Источник:

source: Author of original doc:
ru: Автор источника:

source: ID:
ru: Идентификатор:

source: Version:
ru: Версия:

source: History:
ru: История:

source: Show full size
ru: Показать в натуральную величину

source: Save cover
ru: Сохранить обложку

source: Bookmarks
ru: Закладки

source: Bookmark operations
ru: Операции с закладками

source: Filtering:
ru: Фильтр:

source: Collection
ru: Коллекция

source: Author
ru: Автор

source: Series
ru: Серия

source: Genre
ru: Жанр

source: Date
ru: Дата

source: Filter
ru: Фильтровать

source: Clear filter
ru: Очистить фильтр

source: Confirmation
ru: Подтверждение

source: Are you sure?
ru: Вы уверены?

source: Yes
ru: Да

source: No
ru: Нет

source: Open book
ru: Открыть книгу

source: Notes
ru: Заметки

source: Save book as...
ru: Сохранить книгу как...

source: Remove bookmark
ru: Удалить закладку

source: Collection creation progress
ru: Прогресс создания коллекции

source: Collection refreshing progress
ru: Прогресс обновления коллекции

source: Collecting files...
ru: Сбор файлов...

source: Interruption...
ru: Прерывание...

source: Collection creation progress:
ru: Прогресс создания коллекции:

source: Collection hashing progress:
ru: Прогресс хеширования:

source: Collection refreshing progress:
ru: Прогресс обновления коллекции:

source: Collection created
ru: Коллекция создана

source: Collection refreshed
ru: Коллекция обновлена

source: Collection creation process finished.
ru: Процесс создания коллекции завершён.

source: Collection refresh process finished.
ru: Процесс обновления коллекции завершён.

source: Save as...
ru: Сохранить как...

source: Book successfully saved!
ru: Книга успешно сохранена!

source: Create collection
ru: Создать коллекцию

source: Collection name:
ru: Название коллекции:

source: Path to books directory:
ru: Путь к директории с книгами:

source: Thread number (recommended max value:
ru: Количество потоков (рекомендованное максимальное значение:

source: Disable rar archives support
ru: Отключить поддержку rar архивов

source: Create
ru: Создать

source: Books path
ru: Путь к книгам

source: Collection name cannot be empty!
ru: Название коллекции не может быть пустым!

source: Collection already exists!
ru: Коллекция уже существует!

source: Books path does not exist!
ru: Путь к книгам не существует!

source: Book entry editor
ru: Редактор записи о книге

source: Genre name
ru: Имя жанра

source: Genre code
ru: Код жанра

source: Remove genre
ru: Удалить жанр

source: Author:
ru: Автор:

source: Genre:
ru: Жанр:

source: Add genre
ru: Добавить жанр

source: Restore
ru: Восстановить

source: Book entry was successfully edited!
ru: Запись о книге успешно отредактирована!

source: Error! Book entry was not found in collection.
ru: Ошибка! Запись о книге не была найдена в коллекции.

source: Critical error! See system log for details.
ru: Критическая ошибка! См. системный журнал.

source: Create empty collection
ru: Создать пустую коллекцию

source: Error! Collection name cannot be empty!
ru: Ошибка! Название коллекции не может быть пустым!

source: Error! Collection already exists!
ru: Ошибка! Коллекция уже существует!

source: Error! Books directory not found!
ru: Ошибка! Директория с книгами не найдена!

source: Error! Base file has not been opened for writing!
ru: Ошибка! Файл базы не был открыт для записи!

source: Collection has been successfully created.
ru: Коллекция успешно создана.

source: Export collection base
ru: Экспортировать базу коллекции

source: Collection to export
ru: Коллекция для экспорта

source: Export
ru: Экспорт

source: Export path
ru: Путь для экспорта

source: Error! Base file has not been opened.
ru: Ошибка! Файл базы не открыт.

source: Error! Out path has not been opened for writing.
ru: Ошибка! Файл не открыт для записи.

source: Error! Wrong base file size.
ru: Ошибка! Неверный размер файла базы.

source: Error! Wrong base file size (2).
ru: Ошибка! Неверный размер файла базы (2).

source: Collection base has been exported successfully!
ru: База коллекции успешно экспортирована!

source: Cover
ru: Обложка

source: Import collection base
ru: Импортировать базу коллекции

source: New collection name:
ru: Название новой коллекции:

source: Path to base to be imported:
ru: Путь к базе для импорта:

source: Import
ru: Импорт

source: Open base
ru: Открыть файл базы

source: Select
ru: Выбрать

source: Error! Base file not found!
ru: Ошибка! Файл базы не найден!

source: Error! Base file has not been opened for reading!
ru: Ошибка! Файл базы не был открыт для чтения!

source: Error! Bad base file!
ru: Ошибка! Неверный файл базы!

source: Error! Bad base file (2)!
ru: Ошибка! Неверный файл базы (2)!

source: Collection has been successfully imported.
ru: Коллекция успешно импортирована.

source: Books quantity:
ru: Количество книг:

source: loading
ru: загрузка

source: Surname:
ru: Фамилия:

source: Name:
ru: Имя:

source: Second name:
ru: Отчество:

source: <No>
ru: <Нет>

source: Clear genre
ru: Очистить жанр

source: Search
ru: Поиск

source: Clear
ru: Очистить

source: Show collection files
ru: Показать файлы коллекции

source: Show collection authors
ru: Показать авторов коллекции

source: Show books with notes
ru: Показать книги с заметками

source: Collections
ru: Коллекции

source: Remove collection
ru: Удалить коллекцию

source: Refresh collection
ru: Обновить коллекцию

source: Add books to collection
ru: Добавить книги в коллекцию

source: Add directories with books
ru: Добавить папки с книгами

source: Show bookmarks
ru: Показать закладки

source: Plugins
ru: Плагины

source: Show plugins
ru: Показать плагины

source: Settings
ru: Настройки

source: About
ru: О программе

source: About MyLibrary
ru: О MyLibrary

source: MLBookProc documentation
ru: Документация MLBookProc

source: MLPluginIfc documentation
ru: Документация MLPluginIfc

source: Icon designed by:
ru: Дизайн иконки:

source: MyLibrary is a home librarian
ru: MyLibrary - домашний библиотекарь

source: Author Yury Bobylev
ru: Автор Юрий Бобылев

source: Program uses next libraries:
ru: В программе используются следующие библиотеки:

source: Collection:
ru: Коллекция:

source: Book file path:
ru: Путь к файлу книги:

source: Book path:
ru: Путь к книге:

source: There are some unsaved changes. Close anyway?
ru: Есть не сохранённые изменения. Закрыть в любом случае?

source: Launch
ru: Запустить

source: Disable
ru: Отключить

source: Plugin
ru: Плагин

source: Collection to refresh:
ru: Коллекция для обновления:

source: Remove empty files and directories from collection
ru: Удалить пустые файлы и папки из коллекции

source: Fast refreshing (without hashing)
ru: Быстрое обновление (без хеширования)

source: Remove absent books from bookmarks
ru: Удалить из закладок отсутствующие книги

source: Notes reserve path:
ru: Путь сохранения резервных копий:

source: Make reserve copies of notes
ru: Создать резервные копии заметок

source: Refresh
ru: Обновить

source: This action will remove book from base and from filesystem.
ru: Данное действие удалит книгу из базы и из файловой системы.

source: For removing:
ru: Для удаления:

source: Warning! Book is packed in rar archive.
ru: Предупреждение! Книга упакована в rar архив.

source: Books removing from rar archive is impossible.
ru: Удаление книг из rar архивов невозможно.

source: This action will remove whole archive.
ru: Данное действие удалит архив целиком.

source: Notes will be transfered to
ru: Заметки будут перемещены в

source: Create reserve copy of notes
ru: Создать резервные копии заметок

source: Removing in progress...
ru: Идёт удаление...

source: Book successfully removed.
ru: Книга успешно удалена.

source: Collection removing
ru: Удаление коллекции

source: Reserve copies path:
ru: Путь сохранения резервных копий:

source: Remove
ru: Удалить

source: Collection for removing:
ru: Коллекция для удаления:

source: Continue?
ru: Продолжить?

source: Collection has been removed.
ru: Коллекция удалена.

source: Book operations
ru: Операции с книгами

source: Column
ru: Колонка

source: Sorting...
ru: Сортировка...

source: File operations
ru: Операции с файлами

source: Operations
ru: Операции

source: Create bookmark
ru: Создать закладку

source: Edit book entry
ru: Редактировать запись о книге

source: Move to another collection
ru: Переместить в другую коллекцию

source: Show books
ru: Показать книги

source: Message
ru: Сообщение

source: Error! Bookmark has not been saved!
ru: Ошибка! Закладка не была сохранена!

source: Book is already in bookmarks
ru: Книга уже в закладках

source: Bookmark successfully saved
ru: Закладка успешно сохранена

source: Cover saving
ru: Сохранение обложки

source: Format
ru: Формат

source: Cover saving path
ru: Путь

source: Cover successfully saved!
ru: Обложка успешно сохранена!

source: Search in progress...
ru: Идёт поиск...

source: Search interrupting...
ru: Остановка поиска...

source: Reading base...
ru: Чтение базы...

source: CPU progress
ru: Прогресс ЦП

source: GPU progress
ru: Прогресс видеокарты

source: Reading interrupting...
ru: Остановка чтения...

source: Collecting results...
ru: Сбор результатов...

source: File path
ru: Путь

source: Search settings
ru: Настройки поиска

source: Color settings
ru: Настройки цвета

source: Apply and close
ru: Применить и закрыть

source: Сoefficient of coincedence for search operations:
ru: Коэффициент совпадения для поисковых операций:

source: CPU/GPU operations balans on showing collection authors:
ru: Баланс операций между ЦП и видеокартой при показе авторов коллекции:

source: CPU/GPU operations balans on books search:
ru: Баланс операций между ЦП и видеокартой при поиске книг:

source: Windows
ru: Окна

source: Background color:
ru: Цвет фона:

source: Background image:
ru: Фоновое изображение:

source: Apply buttons
ru: Кнопки "применить"

source: Cancel buttons
ru: Кнопки отмены

source: Operations buttons
ru: Кнопки операций

source: Remove buttons
ru: Кнопки удаления

source: Combo box buttons
ru: Кнопки выпадающих списков

source: Annotation
ru: Аннотация

source: Entries
ru: Поля ввода

source: Labels
ru: Надписи

source: Main menu
ru: Главное меню

source: Popup menu buttons
ru: Кнопки выпадающих меню

source: "Error" labels
ru: Ошибки

source: "Warning" labels
ru: Предупреждения

source: Progress bars
ru: Индикаторы прогресса

source: Table views
ru: Таблицы

source: Frames
ru: Виджеты "Рамка"

source: Font color:
ru: Цвет шрифта:

source: Border color:
ru: Цвет рамки:

source: Font color (hover):
ru: Цвет шрифта (при наведении указателя):

source: Background color (hover):
ru: Цвет фона (при наведении указателя):

source: Font color (active):
ru: Цвет шрифта (при нажатии):

source: Background color (active):
ru: Цвет фона (при нажатии):

source: Progress bar background color:
ru: Цвет фона индикатора прогресса:

source: Progress bar color:
ru: Цвет заполнения индикатора прогресса:

source: Header font color:
ru: Цвет шрифта заголовка:

source: Header background color:
ru: Цвет фона заголовка:

source: Selected line font color:
ru: Цвет шрифта выбранной строки:

source: Selected line background color:
ru: Цвет фона выбранной строки:

source: Image
ru: Изображение

source: All images
ru: Все изображения

source: Moving
ru: Перемещение

source: Book is packed in rar archive.
ru: Книга упакована в rar архив.

source: This operation is not available for rar archives.
ru: Данная операция недоступна для rar архивов.

source: Use "Add books" function from main menu instead.
ru: Используйте функцию "Добавить книги" из главного меню.

source: Collection book to be moved to
ru: Коллекция для перемещения книги

source: Transfer also fbd file if available
ru: Переместить также fbd файл, если доступен

source: Pack book in archive
ru: Упаковать книгу в архив

source: Add to existing archive
ru: Добавить к существующему архиву

source: Choose path
ru: Выбрать путь

source: Path in collection
ru: Путь в коллекции

source: Error! Book has not been found in new location!
ru: Ошибка! Книга не была найдена в новом месте!

source: Book has been successfully moved!
ru: Книга успешно перемещена!

source: Archive file path:
ru: Путь к архиву:

source: Move
ru: Переместить

source: Error! Path in archive cannot be empty!
ru: Ошибка! Путь в архиве не может быть пустым!

source: Error! File with such name is already in archive!
ru: Ошибка! Файл с таким именем уже есть в архиве!
